{
  "extracted_date": "2025-12-12",
  "note": "Extracted from index.html",
  "briefItineraries_raw": "{\n      4: {\n        id: \"vn-4-taste\",\n        name: \"Vietnam in 4 Days – Saigon & Mekong Snapshot\",\n        destinations: \"Ho Chi Minh City, Mekong Delta\",\n        startsIn: \"Ho Chi Minh City, Vietnam\",\n        endsIn: \"Ho Chi Minh City, Vietnam\",\n        tourType: \"Private tour\",\n        travelStyle: \"Highlight Tours, Classic Tours, Family Tours, Luxury Tours\",\n        intro: \"Short but sweet introduction to Vietnam. Start in Ho Chi Minh City with a city highlights tour and Old Quarter. Day trip to Ninh Binh (Trang An or Tam Coc + viewpoints). Finish with a mini-cruise in Ha Long or Bai Tu Long Bay before departure.\",\n        days: [\n          \"Day 1 – Ho Chi Minh City: Arrival, orientation walk and rooftop sunset.\",\n          \"Day 2 – Saigon City Highlights: Independence Palace, Notre Dame, Post Office, War Remnants Museum, Ben Thanh Market.\",\n          \"Day 3 – Mekong Delta Day Trip: My Tho, boat ride, canals, local houses, honey tea and fruits.\",\n          \"Day 4 – Free time & departure from Ho Chi Minh City.\"\n        ]\n      },\n      6: {\n        id: \"vn-6-coast\",\n        name: \"Vietnam in 6 Days – Saigon, Mekong & Central Coast\",\n        destinations: \"Ho Chi Minh City, Mekong Delta, Da Nang, Hoi An\",\n        startsIn: \"Ho Chi Minh City, Vietnam\",\n        endsIn: \"Da Nang / Hoi An, Vietnam\",\n        tourType: \"Private tour\",\n        travelStyle: \"Highlight Tours, Classic Tours, Family Tours, Luxury Tours\",\n        intro: \"From busy Saigon to charming Hoi An. This 6-day itinerary takes you from the dynamic Ho Chi Minh City and the serene Mekong Delta to the enchanting ancient town of Hoi An.\",\n        days: [\n          \"Day 1 – Ho Chi Minh City: Arrival and evening in the city center.\",\n          \"Day 2 – Saigon City Tour: Main landmarks + local street food experience.\",\n          \"Day 3 – Mekong Delta: Boat trip, canals, local crafts and village life.\",\n          \"Day 4 – Fly to Da Nang, transfer to Hoi An, evening lanterns in Ancient Town.\",\n          \"Day 5 – Hoi An Old Town & countryside: Walking tour + basket boat or Tra Que village.\",\n          \"Day 6 – Free time in Hoi An (beach/old town) and onward departure.\"\n        ]\n      },\n      8: {\n        id: \"vn-8-classic\",\n        name: \"Vietnam in 8 Days – Classic Highlights South to Central\",\n        destinations: \"Ho Chi Minh City, Mekong Delta, Cu Chi, Da Nang, Hoi An\",\n        startsIn: \"Ho Chi Minh City, Vietnam\",\n        endsIn: \"Da Nang / Hoi An, Vietnam\",\n        tourType: \"Private tour\",\n        travelStyle: \"Highlight Tours, Classic Tours, Family Tours, Luxury Tours\",\n        intro: \"Saigon, Mekong Delta, Da Nang & Hoi An. This 8-day itinerary offers a comprehensive journey through the highlights of Southern and Central Vietnam.\",\n        days: [\n          \"Day 1 – Ho Chi Minh City: Arrival, easy evening in District 1.\",\n          \"Day 2 – Saigon City Highlights: Independence Palace, Cathedral, Post Office, War Museum, Ben Thanh.\",\n          \"Day 3 – Cu Chi Tunnels: Half-day visit to the underground network + free afternoon.\",\n          \"Day 4 – Mekong Delta: Boat trip, floating/local markets, canals and village lunch.\",\n          \"Day 5 – Fly to Da Nang, transfer to Hoi An, lantern-lit evening by the river.\",\n          \"Day 6 – Hoi An Old Town: Walking tour, Japanese Bridge, assembly halls, local crafts.\",\n          \"Day 7 – Countryside Experience: Tra Que village & coconut basket boats OR beach day.\",\n          \"Day 8 – Free time in Hoi An and departure from Da Nang.\"\n        ]\n      },\n      10: {\n        id: \"vn-10-discovery\",\n        name: \"Vietnam in 10 Days – South, Central & a Taste of the North\",\n        destinations: \"Ho Chi Minh City, Mekong Delta, Da Nang, Hoi An, Ba Na Hills, Hanoi, Ninh Binh\",\n        startsIn: \"Ho Chi Minh City, Vietnam\",\n        endsIn: \"Hanoi, Vietnam\",\n        tourType: \"Private tour\",\n        travelStyle: \"Highlight Tours, Classic Tours, Family Tours, Luxury Tours\",\n        intro: \"Saigon, Mekong, Hoi An and Hanoi snapshot. This 10-day itinerary offers a comprehensive journey through the highlights of Southern, Central, and Northern Vietnam.\",\n        days: [\n          \"Day 1–2 – Ho Chi Minh City: Arrival + full city tour and Cu Chi Tunnels.\",\n          \"Day 3 – Mekong Delta: Day trip with boat, canals, local farms and lunch.\",\n          \"Day 4 – Fly to Da Nang, transfer to Hoi An, evening in Ancient Town.\",\n          \"Day 5 – Hoi An: Walking tour + Tra Que & coconut palm forest.\",\n          \"Day 6 – Ba Na Hills: Golden Bridge, cable car, French Village.\",\n          \"Day 7 – Fly Da Nang → Hanoi, Old Quarter orientation.\",\n          \"Day 8 – Hanoi City Tour: Ho Chi Minh complex, Temple of Literature, Old Quarter.\",\n          \"Day 9 – Ninh Binh day trip: Hoa Lu, Trang An or Tam Coc, viewpoints.\",\n          \"Day 10 – Free time in Hanoi and departure.\"\n        ]\n      },\n      12: {\n        id: \"vn-12-highlights\",\n        name: \"Vietnam in 12 Days – Highlights with Ha Long Bay\",\n        destinations: \"Ho Ch... (truncated)",
  "detailedItineraries_raw": "{\n      4: {\n        id: \"vn-4-taste-detailed\",\n        name: \"Vietnam in 4 Days – Saigon & Mekong Snapshot (Detailed)\",\n        days: [\n          { day: 1, title: \"Ho Chi Minh City Arrival & Orientation\", details: \"Arrive at Tan Son Nhat International Airport (SGN), where you'll be met by your private driver and transferred to your hotel in the city center. After check-in, enjoy free time to relax or take an orientation walk around the bustling streets of District 1. In the evening, consider a rooftop bar for sunset views over the city.\" },\n          { day: 2, title: \"Saigon City Highlights Tour\", details: \"Embark on a full-day city tour of Ho Chi Minh City. Visit the historic Reunification Palace, the iconic Notre Dame Cathedral, and the Central Post Office. Explore the War Remnants Museum to understand Vietnam's recent history, and immerse yourself in the vibrant atmosphere of Ben Thanh Market. Lunch will be served at a local restaurant, offering authentic Vietnamese cuisine.\" },\n          { day: 3, title: \"Mekong Delta Discovery (My Tho & Ben Tre)\", details: \"Take a full-day excursion to the Mekong Delta. Drive to My Tho, where you'll take a boat trip on the Mekong River. Visit various islands, enjoy a sampan ride through narrow canals lined with coconut palms, and experience local life. Sample fresh fruits, enjoy honey tea, and visit a coconut candy workshop. Lunch will be served at a local restaurant on one of the islands before returning to Ho Chi Minh City in the late afternoon.\" },\n          { day: 4, title: \"Ho Chi Minh City Departure\", details: \"Enjoy a leisurely breakfast at your hotel. Depending on your flight schedule, you'll have free time for last-minute souvenir shopping or a final stroll. Your private driver will transfer you to Tan Son Nhat International Airport (SGN) for your onward departure.\" }\n        ]\n      },\n      6: {\n        id: \"vn-6-coast-detailed\",\n        name: \"Vietnam in 6 Days – Saigon, Mekong & Central Coast (Detailed)\",\n        days: [\n          { day: 1, title: \"Ho Chi Minh City Arrival & Evening Exploration\", details: \"Arrive at Tan Son Nhat International Airport (SGN), meet your private driver, and transfer to your hotel in Ho Chi Minh City. After check-in, enjoy a free evening to explore the vibrant city center, perhaps with a street food tour or a visit to Ben Thanh Night Market.\" },\n          { day: 2, title: \"Saigon City Tour & Street Food\", details: \"Discover Ho Chi Minh City's iconic landmarks including the Reunification Palace, Notre Dame Cathedral, and Central Post Office. Delve into the local culture with a guided street food experience, sampling various Vietnamese delicacies. Visit the War Remnants Museum for historical insights. Lunch at a local restaurant.\" },\n          { day: 3, title: \"Mekong Delta Full Day Excursion\", details: \"Journey to the Mekong Delta for a full-day tour. Enjoy a boat trip on the Mekong River, explore lush islands, and take a traditional sampan ride through narrow canals. Visit local workshops to see coconut candy making and honey bee farms. Enjoy a fresh local lunch before returning to Ho Chi Minh City.\" },\n          { day: 4, title: \"Fly to Da Nang & Transfer to Hoi An\", details: \"After breakfast, transfer to Tan Son Nhat Airport for your flight to Da Nang. Upon arrival, meet your driver and transfer directly to your hotel in Hoi An. In the evening, immerse yourself in the magical atmosphere of Hoi An Ancient Town, illuminated by thousands of lanterns.\" },\n          { day: 5, title: \"Hoi An Old Town & Countryside Discovery\", details: \"Begin with a walking tour of Hoi An Ancient Town, a UNESCO World Heritage site. Explore the Japanese Covered Bridge, Phuc Kien Assembly Hall, and traditional houses. In the afternoon, choose between a fun basket boat ride in the Coconut Forest or a visit to Tra Que Vegetable Village for a hands-on farming experience. Enjoy a local lunch.\" },\n          { day: 6, title: \"Hoi An Departure\", details: \"Enjoy a leisurely breakfast and free time in Hoi An for last-minute shopping, relaxing at the beach, or enjoying a coffee by the river. Your private driver will transfer you to Da Nang International Airport (DAD) for your onward flight.\" }\n        ]\n      },\n      8: {\n        id: \"vn-8-classic-detailed\",\n        name: \"Vietnam in 8 Days – Classic Highlights South to Central (Detailed)\",\n        days: [\n          { day: 1, title: \"Ho Chi Minh City Arrival & Leisure\", details: \"Arrive at Tan Son Nhat International Airport (SGN), where your private driver will meet you and transfer you to your hotel in Ho Chi Minh City. After check-in, enjoy a relaxed evening, perhaps with a stroll around the vibrant city center or a quiet dinner.\" },\n          { day: 2, title: \"Saigon City Highlights Tour\", details: \"Explore the iconic landmarks of Ho Chi Minh City on a full-day tour. Visit the Reunification Palace, Notre Dame Cathedral, and the historic Central Post Office. Gain insights into the Vietnam War at the War Rem... (truncated)",
  "briefItineraries_count": 34,
  "detailedItineraries_count": 34
}